using ISO3166;

namespace Domain.Validators;

public static class CountryCodes
{
    public static HashSet<string> AllCountryCodes = new(Country.List.Select(c => c.TwoLetterCode));


    private static Dictionary<string, string> _countryCodes =
        new(StringComparer.OrdinalIgnoreCase)
        {
            { "Венгрия", "HU" },
            { "Россия", "RU" },
            { "Македония", "MK" },
            { "Украина", "UA" },
            { "Беларусь", "BY" },
            { "Казахстан", "KZ" },
            { "Англия", "GB" },
            { "Германия", "DE" },
            { "Франция", "FR" },
            { "Италия", "IT" },
            { "Испания", "ES" },
            { "Китай", "CN" },
            { "Япония", "JP" },
            { "США", "US" },
            { "Великобритания", "GB" },
            { "Австралия", "AU" },
            { "Канада", "CA" },
            { "Индия", "IN" },
            { "Бразилия", "BR" },
            { "Южная Корея", "KR" },
            { "Мексика", "MX" },
            { "Индонезия", "ID" },
            { "Турция", "TR" },
            { "Аргентина", "AR" },
            { "Латвия", "LV" },
            { "Хорватия", "HR" },
            { "Словения", "SI" },
            { "Тайвань", "TW" },
            { "Южноафриканская Республика", "ZA" },
            { "Новая Зеландия", "NZ" },
            { "Швеция", "SE" },
            { "Норвегия", "NO" },
            { "Нидерланды", "NL" },
            { "Дания", "DK" },
            { "Филиппины", "PH" },
            { "Польша", "PL" },
            { "Чехия", "CZ" },
            { "Швейцария", "CH" },
            { "Австрия", "AT" },
            { "Белгия", "BE" },
            { "Малайзия", "MY" },
            { "Сингапур", "SG" },
            { "Таиланд", "TH" },
            { "Венесуэла", "VE" },
            { "Колумбия", "CO" },
            { "Перу", "PE" },
            { "Чили", "CL" },
            { "Греция", "GR" },
            { "Португалия", "PT" },
            { "Ирландия", "IE" },
            { "Румыния", "RO" },
            { "Болгария", "BG" },
            { "Грузия", "GE" },
            { "Армения", "AM" },
            { "Азербайджан", "AZ" },
            { "Узбекистан", "UZ" },
            { "Таджикистан", "TJ" },
            { "Кыргызстан", "KG" },
            { "Туркменистан", "TM" },
            { "Молдова", "MD" },
            { "Монголия", "MN" },
            { "Алжир", "DZ" },
            { "Ливия", "LY" },
            { "Марокко", "MA" },
            { "Тунис", "TN" },
            { "Египет", "EG" },
            { "Нигерия", "NG" },
            { "Кения", "KE" },
            { "Эфиопия", "ET" },
            { "Сенегал", "SN" },
            { "Мавритания", "MR" },
            { "Лаос", "LA" },
            { "Вьетнам", "VN" },
            { "Пакистан", "PK" },
            { "Шри-Ланка", "LK" },
            { "Непал", "NP" },
            { "Бангладеш", "BD" },
            { "Мальдивы", "MV" },
            { "Сирия", "SY" },
            { "Ирак", "IQ" },
            { "Йемен", "YE" },
            { "Ливан", "LB" },
            { "Израиль", "IL" },
            { "Иран", "IR" },
            { "Афганистан", "AF" },
            { "Куба", "CU" },
            { "Гаити", "HT" },
            { "Доминиканская Республика", "DO" },
            { "Бермудские Острова", "BM" },
            { "Барбадос", "BB" },
            { "Ямайка", "JM" },
            { "Антигуа и Барбуда", "AG" },
            { "Тринидад и Тобаго", "TT" },
            { "Гренада", "GD" },
            { "Багамы", "BS" },
            { "Сент-Люсия", "LC" },
            { "Сент-Винсент и Гренадины", "VC" }
        };

    public static string GetCodeByRussianName(string countryName)
    {
        try
        {
            var code = _countryCodes[countryName];
            return code;
        }
        catch
        {
            return null;
        }
    }
}